AccumulationRegisters/ТоварыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыОрганизаций</Name>
			<Comment>(Общ)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комиссионер</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчетаБУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыОрганизаций/Ext/RecordSetModule.bsl
Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений

// Выполняет приход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьПриход() Экспорт

	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Приход);

КонецПроцедуры // ВыполнитьПриход()

// Выполняет расход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьРасход() Экспорт

	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Расход);

КонецПроцедуры // ВыполнитьРасход()

// Выполняет движения по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьДвижения() Экспорт

	Загрузить(мТаблицаДвижений);

КонецПроцедуры // ВыполнитьДвижения()

// Процедура контролирует остаток по данному регистру по переданному документу
// и его табличной части. В случае недостатка товаров выставляется флаг отказа и 
// выдается сообщегние.
//
// Параметры:
//  ДокументОбъект    - объект проводимого документа, 
//  ИмяТабличнойЧасти - строка, имя табличной части, которая проводится по регистру, 
//  СтруктураШапкиДокумента - структура, содержащая значения "через точку" ссылочных реквизитов по шапке документа,
//  Отказ             - флаг отказа в проведении,
//  Заголовок         - строка, заголовок сообщения об ошибке проведения.
//
Процедура КонтрольОстатков(ДокументОбъект, ИмяТабличнойЧасти, СтруктураШапкиДокумента, Отказ, Заголовок) Экспорт

	//Дандали В. 
	Если Константы.ОтключитьКонтрольПоТоварамОрганизации.Получить() Тогда
		Возврат;
	КонецЕсли;
	//Дандали В. 
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	ИмяДокумента        = МетаданныеДокумента.Имя;
	ИмяТаблицы          = ИмяДокумента + "." + СокрЛП(ИмяТабличнойЧасти);
	
	БУ = ПланыСчетов.Хозрасчетный.ТоварыНаСкладе.ПолучитьОбъект();
	ВестиУчетПоДопРазрезамРегл  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеПозиции, "ВидСубконто") = Неопределено, Ложь, Истина);
	ВестиСкладскойУчетБУ = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады, "ВидСубконто") = Неопределено, Ложь, Истина);
	
	Если ТипЗнч(СтруктураШапкиДокумента.Ссылка) = Тип("ДокументСсылка.КорректировкаСерийИХарактеристикТоваров") Тогда
		ТекстХарактеристикаНоменклатуры = "ХарактеристикаНоменклатурыСтарая";
		ТекстСерияНоменклатуры = "СерияНоменклатурыСтарая";
	Иначе
		ТекстХарактеристикаНоменклатуры = "ХарактеристикаНоменклатуры";
		ТекстСерияНоменклатуры = "СерияНоменклатуры";
	КонецЕсли; 
	
	ТекстКачество = "Качество";
	
	ЕстьСерия             = ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента(ТекстСерияНоменклатуры, МетаданныеДокумента, ИмяТабличнойЧасти) И ВестиУчетПоДопРазрезамРегл;
	ЕстьХарактеристика    = ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента(ТекстХарактеристикаНоменклатуры, МетаданныеДокумента, ИмяТабличнойЧасти) И ВестиУчетПоДопРазрезамРегл;
	ЕстьДокументРезерва   = ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ДокументРезерва", МетаданныеДокумента, ИмяТабличнойЧасти);
	ЕстьДокументПередачи  = ОбщегоНазначения.ЕстьРеквизитДокумента("ДокументПередачи", МетаданныеДокумента);
	ЕстьКачество          = ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента(ТекстКачество, МетаданныеДокумента, ИмяТабличнойЧасти) И ВестиУчетПоДопРазрезамРегл;
	ЕстьФлагУказанияСерий = ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СерияУказываетсяПриОтпускеСоСклада", МетаданныеДокумента, ИмяТабличнойЧасти);
	ЕстьКоэффициент       = ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("Коэффициент", МетаданныеДокумента, ИмяТабличнойЧасти);
	ЕстьСчетУчетаБУ       = ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СчетУчетаБУ", МетаданныеДокумента, ИмяТабличнойЧасти);
	ЕстьСкладВТабЧасти    = ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("Склад", МетаданныеДокумента, ИмяТабличнойЧасти);
	ЕстьСклад             = ОбщегоНазначения.ЕстьРеквизитДокумента("Склад", МетаданныеДокумента);

	ЕстьКлючСтроки         = ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("КлючСтроки", МетаданныеДокумента, ИмяТабличнойЧасти);
	ЕстьСоставНабора       = Ложь;

	Если ЕстьКлючСтроки Тогда
		Если ОбщегоНазначения.ЕстьТабЧастьДокумента("СоставНабора", МетаданныеДокумента)
		   И ДокументОбъект.СоставНабора.Количество() > 0 Тогда
			ЕстьСоставНабора = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ТекстСкладаДок           = ? (ЕстьСклад, ?(Не ЕстьСкладВТабЧасти, "
	|   &Склад                                      КАК Склад, ", "
	|   Док.Склад                                   КАК Склад,"), "");
	ТекстСкладаОстатки       = ? (ЕстьСклад, ?(ЕстьСкладВТабЧасти, "
	| И Док.Склад                       = Остатки.Склад "
	, "
	| И &Склад                          = Остатки.Склад "), "");
	ТекстСкладаСгруппировать = ? (ЕстьСклад, ?(ЕстьСкладВТабЧасти, ",
	|    Док.Склад", ""), "");
	
	// Текст вложенного запроса, ограничивающего номенклатуру при получении остатков
	Если ЕстьСоставНабора Тогда
		ТекстЗапросаСписокНоменклатуры = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Док.Номенклатура КАК Номенклатура
		|ИЗ
		|	(
		|	ВЫБРАТЬ
		|		Док.Номенклатура
		|	ИЗ
		|		Документ." + ИмяТаблицы +" КАК Док
		|	ГДЕ
		|		Док.Ссылка = &ДокументСсылка
		|		И НЕ Док.Номенклатура.Комплект
		|       И Не Док.Номенклатура.Услуга
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		Док.Номенклатура
		|	ИЗ
		|		Документ." + ИмяДокумента + ".СоставНабора КАК Док
		|	ГДЕ
		|		Док.Ссылка = &ДокументСсылка
		|		И НЕ Док.Номенклатура.Комплект
		|       И Не Док.Номенклатура.Услуга
		|
		|	) КАК Док
		|";	
		
		ТекстЗапросаРеквизитыДокумента = "
		|	(ВЫБРАТЬ
		|			Док.Ссылка,
		|			Док.Номенклатура,
		|		" + ?(ЕстьКачество,        "Док.Качество,",                     "") + "
		|		" + ?(ЕстьХарактеристика,  "Док.ХарактеристикаНоменклатуры,",   "") + "
		|		" + ?(ЕстьСерия,           "Док.СерияНоменклатуры,",            "") + "
		|		" + ?(ЕстьКоэффициент,     "Док.Коэффициент,",                  "") + "
		|		" + ?(ЕстьСчетУчетаБУ,     "Док.СчетУчетаБУ,",                  "") + "
		|		" + ?(ЕстьДокументРезерва, "Док.ДокументРезерва,",              "") + "
		|		" + ?(ЕстьСкладВТабЧасти, "Док.Склад,",              "") + "
		|			Док.Количество
		|		ИЗ
		|			Документ." + ИмяТаблицы + " КАК Док
		|		ГДЕ
		|			Док.Ссылка = &ДокументСсылка
		|			И НЕ Док.Номенклатура.Комплект
		|           И Не Док.Номенклатура.Услуга
		|		ОБЪЕДИНИТЬ ВСЕ
		|
		|		ВЫБРАТЬ
		|			Док.Ссылка,
		|			Док.Номенклатура,
		|		" + ?(ЕстьКачество,        "Док.Качество,",                     "") + "
		|		" + ?(ЕстьХарактеристика,  "Док.ХарактеристикаНоменклатуры,",   "") + "
		|		" + ?(ЕстьСерия,           "Док.СерияНоменклатуры,",            "") + "
		|		" + ?(ЕстьКоэффициент,     "Док.Коэффициент,",                  "") + "
		|		" + ?(ЕстьСчетУчетаБУ,     "Док.СчетУчетаБУ,",                  "") + "
		|		" + ?(ЕстьДокументРезерва, "Док.ДокументРезерва,",              "") + "
		|		" + ?(ЕстьСкладВТабЧасти, "Док.Склад,",              "") + "
		|			Док.Количество
		|		ИЗ
		|			(ВЫБРАТЬ
		|				ДокНаб.Ссылка,
		|				ДокНаб.Номенклатура,
		|";
		Если ЕстьКачество Тогда
		ТекстЗапросаРеквизитыДокумента = ТекстЗапросаРеквизитыДокумента + "
		|				ВЫБОР
		|					КОГДА ДокНаб.Качество = &ПустоеКачество ТОГДА ДокТов.Качество
		|					ИНАЧЕ ДокНаб.Качество
		|				КОНЕЦ КАК Качество,
		|";
		КонецЕсли;
		ТекстЗапросаРеквизитыДокумента = ТекстЗапросаРеквизитыДокумента + "
		|			" + ?(ЕстьХарактеристика,  "ДокНаб.ХарактеристикаНоменклатуры,",                   "") + "
		|			" + ?(ЕстьСерия,           "ДокНаб.СерияНоменклатуры,",                            "") + "
		|			" + ?(ЕстьКоэффициент,     "ДокНаб.ЕдиницаИзмерения.Коэффициент КАК Коэффициент,", "") + "
		|			" + ?(ЕстьСчетУчетаБУ,     "ДокНаб.СчетУчетаБУ,", 								   "") + "
		|			" + ?(ЕстьДокументРезерва, "ДокТов.ДокументРезерва,",                              "") + "
		|			" + ?(ЕстьСкладВТабЧасти, "ДокТов.Склад,",              						   "") + "
		|				ДокНаб.Количество * ДокТов.Количество КАК Количество
		|			ИЗ
		|				Документ." + ИмяДокумента + ".СоставНабора   КАК ДокНаб
		|				ЛЕВОЕ СОЕДИНЕНИЕ Документ." + ИмяТаблицы + " КАК ДокТов
		|					ПО ДокТов.КлючСтроки = ДокНаб.КлючСтроки
		|					 И ДокТов.Ссылка     = &ДокументСсылка
		|			ГДЕ
		|				ДокНаб.Ссылка = &ДокументСсылка
		|			И НЕ ДокНаб.Номенклатура.Комплект
		|           И Не ДокНаб.Номенклатура.Услуга

		|			) КАК Док
		|
		|		) КАК Док
		|";
		
	Иначе
		ТекстЗапросаСписокНоменклатуры = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Номенклатура 
		|ИЗ
		|	Документ." + ИмяТаблицы +"
		|ГДЕ  Ссылка = &ДокументСсылка";
		
		ТекстЗапросаРеквизитыДокумента = "(
		|ВЫБРАТЬ
		|Док.Ссылка,
		|Док.Номенклатура, "+
		?(ЕстьХарактеристика, "Док."+ТекстХарактеристикаНоменклатуры+", ","")+
		?(ЕстьСерия, "Док."+ТекстСерияНоменклатуры+", ","")+
		?(ЕстьКоэффициент, "Док.Коэффициент, ","")+
		?(ЕстьКачество, "Док.Качество, ","")+
		?(ЕстьСчетУчетаБУ,     "Док.СчетУчетаБУ,",                  "") + 
        ?(ЕстьДокументРезерва, "Док.ДокументРезерва, ","")+
		?(ЕстьСкладВТабЧасти, "Док.Склад,","") + "
		|Док.Количество
		|ИЗ	Документ." + ИмяТаблицы + " КАК Док
		|	ГДЕ
		|		Док.Ссылка = &ДокументСсылка
		|		И НЕ Док.Номенклатура.Комплект
		|       И Не Док.Номенклатура.Услуга
		|) КАК Док
		|";
		
	КонецЕсли;


	Запрос = Новый Запрос;
    ТекСклад = ?(ЕстьСклад, СтруктураШапкиДокумента.Склад, Неопределено);
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", СтруктураШапкиДокумента.Ссылка);
	Запрос.УстановитьПараметр("Склад", ТекСклад); 
	Запрос.УстановитьПараметр("Организация", СтруктураШапкиДокумента.Организация); 
	Запрос.УстановитьПараметр("ПустаяСерия", Справочники.СерииНоменклатуры.ПустаяСсылка()); 
	Запрос.УстановитьПараметр("ПустойКомиссионер", Справочники.Контрагенты.ПустаяСсылка()); 
	Запрос.УстановитьПараметр("ПустоеКачество", Справочники.Качество.ПустаяСсылка());	
	
	Если СтруктураШапкиДокумента.Свойство("Комиссионер") Тогда
		Запрос.УстановитьПараметр("Комиссионер", СтруктураШапкиДокумента.Комиссионер); 
	Иначе
		Запрос.УстановитьПараметр("Комиссионер", Справочники.Контрагенты.ПустаяСсылка()); 
	КонецЕсли;
	
	Если ЕстьДокументПередачи Тогда
		Запрос.УстановитьПараметр("ДокументПередачи", СтруктураШапкиДокумента.ДокументПередачи);
	КонецЕсли;
	
	Запрос.Текст = "
	|ВЫБРАТЬ // Запрос, контролирующий остатки на складах
	|	Док.Номенклатура                                       КАК Номенклатура,
	|	Док.Номенклатура.ЕдиницаХраненияОстатков               КАК ЕдиницаХраненияОстатков,"
	+ ?(ЕстьСчетУчетаБУ, "
	|	Док.СчетУчетаБУ                                        КАК СчетУчетаБУ,"
	,"")
	+ ?(ВестиСкладскойУчетБУ, ТекстСкладаДок, "") 
	+ ?(ЕстьХарактеристика, "
	|	Док." + ТекстХарактеристикаНоменклатуры + "            КАК ХарактеристикаНоменклатуры,"
	,"")
	+ ?(ЕстьСерия, "
	|	Док." + ТекстСерияНоменклатуры + "                     КАК СерияНоменклатуры,"
	,"") + "
	|   &Комиссионер                                           КАК Комиссионер," 
	+ ?(ЕстьКоэффициент, "
	|	СУММА(Док.Количество * Док.Коэффициент /Док.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент) КАК ДокументКоличество,", "
	|	СУММА(Док.Количество)                                  КАК ДокументКоличество,") + "
	|	МАКСИМУМ(Остатки.КоличествоОстаток)                    КАК ОстатокКоличество
	|ИЗ 
	|	" + ТекстЗапросаРеквизитыДокумента + " 
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыОрганизаций.Остатки(,
	|		Номенклатура В (" + ТекстЗапросаСписокНоменклатуры + ")
	|	И Организация = &Организация
	|   И Комиссионер = &Комиссионер
	|	) КАК Остатки
	|ПО 
	|	Док.Номенклатура        = Остатки.Номенклатура "
	+ ?(ЕстьСчетУчетаБУ, "
	| И Док.СчетУчетаБУ         = Остатки.СчетУчетаБУ"
	,"")
	+ ?(ВестиСкладскойУчетБУ, ТекстСкладаОстатки, "")
	+ ?(ЕстьХарактеристика, "
	| И Док." + ТекстХарактеристикаНоменклатуры + "= Остатки.ХарактеристикаНоменклатуры"
	,"")
	+ ?(ЕстьСерия, "
	| И Док." + ТекстСерияНоменклатуры + "           = Остатки.СерияНоменклатуры"
	,"")
	+ ?(ЕстьКачество, "
	| И Док." + ТекстКачество + "                   = Остатки.Качество"
	,"") + "
	
	|ГДЕ
	|	Док.Ссылка  =  &ДокументСсылка
	|	И Не Док.Номенклатура.Услуга // остатки по услугам контролировать не надо.
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	Док.Номенклатура "
	+ ?(ЕстьХарактеристика, "
	|	, Док." + ТекстХарактеристикаНоменклатуры
	,"")
	+ ?(ЕстьСерия, "
	|	, Док." + ТекстСерияНоменклатуры
	,"")
	+ ?(ЕстьСчетУчетаБУ, ",
	|    Док.СчетУчетаБУ", "")
	+ ?(ВестиСкладскойУчетБУ, ТекстСкладаСгруппировать, "")
	+ ?(ЕстьКачество, "
	|	, Док." + ТекстКачество
	,"") + "	
	|
	|ДЛЯ ИЗМЕНЕНИЯ РегистрНакопления.ТоварыОрганизаций.Остатки // Блокирующие чтение таблицы остатков регистра для разрешения коллизий многопользовательской работы
	|";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		КоличествоПоОрганизации        = ?(Выборка.ОстатокКоличество = NULL, 0, Выборка.ОстатокКоличество);

		Если КоличествоПоОрганизации < Выборка.ДокументКоличество Тогда

			СтрокаСообщения = НСтр("ru='Остатка по организации ';uk='Залишку по організації '") + ДокументОбъект.Организация + НСтр("ru=' товара ';uk=' товару '") +  
			УправлениеЗапасами.ПредставлениеНоменклатуры(СокрЛП(Выборка.Номенклатура), 
			                          ?(ЕстьХарактеристика, СокрЛП(Выборка.ХарактеристикаНоменклатуры), ""),
			                          ?(ЕстьСерия, СокрЛП(Выборка.СерияНоменклатуры),"")) + 
			                          ?(НЕ ЗначениеЗаполнено(Выборка.Комиссионер), "", НСтр("ru=' у комиссионера ';uk=' у комісіонера '") + Выборка.Комиссионер) +
			НСтр("ru=' недостаточно.';uk=' недостатньо.'");

			Если НЕ УправлениеДопПравамиПользователей.РазрешеноПревышениеОстаткаТоваровОрганизации(Ложь) Тогда
				УправлениеЗапасами.ОшибкаНетОстатка(СтрокаСообщения, КоличествоПоОрганизации, Выборка.ДокументКоличество,
				СокрЛП(Выборка.ЕдиницаХраненияОстатков), Отказ, Заголовок);
			Иначе
				СтрокаСообщения = СтрокаСообщения + Символы.ПС + Символы.Таб
				                + НСтр("ru='Не хватает ';uk='Не вистачає '") + (Выборка.ДокументКоличество - КоличествоПоОрганизации) + " " + СокрЛП(Выборка.ЕдиницаХраненияОстатков)
				                + НСтр("ru='; Остаток ';uk='; Залишок '") + КоличествоПоОрганизации + " " + СокрЛП(Выборка.ЕдиницаХраненияОстатков)
				                + "; Требуется " + Выборка.ДокументКоличество + " " + СокрЛП(Выборка.ЕдиницаХраненияОстатков);
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаСообщения);
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // КонтрольОстатков()

// Процедура контролирует остаток по данному регистру по переданному документу
// и его табличной части. В случае недостатка товаров выставляется флаг отказа и 
// выдается сообщегние.
//
// Параметры:
//  ДокументОбъект    - объект проводимого документа, 
//  ИмяТабличнойЧасти - строка, имя табличной части, которая проводится по регистру, 
//  СтруктураШапкиДокумента - структура, содержащая значения "через точку" ссылочных реквизитов по шапке документа,
//  Отказ             - флаг отказа в проведении,
//  Заголовок         - строка, заголовок сообщения об ошибке проведения.
//
Процедура КонтрольОстатковПоШапке(ДокументОбъект, СтруктураШапкиДокумента, Отказ, Заголовок) Экспорт

	//Дандали В. 
	Если Константы.ОтключитьКонтрольПоТоварамОрганизации.Получить() Тогда
		Возврат;
	КонецЕсли;
	//Дандали В. 
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	ИмяДокумента        = МетаданныеДокумента.Имя;
	ИмяТаблицы          = ИмяДокумента;
	
	БУ = ПланыСчетов.Хозрасчетный.ТоварыНаСкладе.ПолучитьОбъект();
	ВестиУчетПоДопРазрезамРегл  = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеПозиции, "ВидСубконто") = Неопределено, Ложь, Истина);
	ВестиСкладскойУчетБУ = ?(БУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады, "ВидСубконто") = Неопределено, Ложь, Истина);
	
	Если ТипЗнч(СтруктураШапкиДокумента.Ссылка) = Тип("ДокументСсылка.КорректировкаСерийИХарактеристикТоваров") Тогда
		ТекстХарактеристикаНоменклатуры = "ХарактеристикаНоменклатурыСтарая";
		ТекстСерияНоменклатуры = "СерияНоменклатурыСтарая";
	Иначе
		ТекстХарактеристикаНоменклатуры = "ХарактеристикаНоменклатуры";
		ТекстСерияНоменклатуры = "СерияНоменклатуры";
	КонецЕсли; 
	
	ЕстьСерия           = ОбщегоНазначения.ЕстьРеквизитДокумента(ТекстХарактеристикаНоменклатуры, МетаданныеДокумента) И ВестиУчетПоДопРазрезамРегл;
	ЕстьХарактеристика  = ОбщегоНазначения.ЕстьРеквизитДокумента(ТекстСерияНоменклатуры, МетаданныеДокумента) И ВестиУчетПоДопРазрезамРегл;
	ЕстьДокументРезерва = ОбщегоНазначения.ЕстьРеквизитДокумента("ДокументРезерва", МетаданныеДокумента);
	ЕстьСклад           = ОбщегоНазначения.ЕстьРеквизитДокумента("Склад", МетаданныеДокумента);
	ЕстьСчетУчетаБУ     = ОбщегоНазначения.ЕстьРеквизитДокумента("СчетУчетаБУ", МетаданныеДокумента);

	ТекстСкладаДок           = ?(ЕстьСклад, "
	|   Док.Склад,", "");
	ТекстСкладаОстатки       = ?(ЕстьСклад, "
	| И Док.Склад                       = Остатки.Склад "
	, "");
	ТекстСкладаСгруппировать = ?(ЕстьСклад, ",
	|    Док.Склад", "");
	
	// Текст вложенного запроса, ограничивающего номенклатуру при получении остатков
	ТекстЗапросаСписокНоменклатуры = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура 
	|ИЗ
	|	Документ." + ИмяТаблицы +"
	|ГДЕ Ссылка = &ДокументСсылка";


	Запрос = Новый Запрос;
    ТекСклад = СтруктураШапкиДокумента.Склад;
	Если ТипЗнч(СтруктураШапкиДокумента.Ссылка) = Тип("ДокументСсылка.ВводВЭксплуатациюОС") Тогда
		ТекСчетУчетаБУ = СтруктураШапкиДокумента.СчетУчетаБУВнеоборотногоАктива;
		ТекстКоличество = "
		|	1 КАК ДокументКоличество, ";
	Иначе
	    ТекСчетУчетаБУ = СтруктураШапкиДокумента.СчетУчетаБУ;
		ТекстКоличество = "
		|	СУММА(Док.Количество * Док.Коэффициент /Док.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент) КАК ДокументКоличество, ";
	КонецЕсли; 
	
	// Установим параметры запроса 
	Запрос.УстановитьПараметр("СчетУчетаБУ", ТекСчетУчетаБУ);
	Запрос.УстановитьПараметр("ДокументСсылка", СтруктураШапкиДокумента.Ссылка);
	Запрос.УстановитьПараметр("Организация", СтруктураШапкиДокумента.Организация); 
	
	Если СтруктураШапкиДокумента.Свойство("Комиссионер") Тогда
		Запрос.УстановитьПараметр("Комиссионер", СтруктураШапкиДокумента.Комиссионер); 
	Иначе
		Запрос.УстановитьПараметр("Комиссионер", Справочники.Контрагенты.ПустаяСсылка()); 
	КонецЕсли;
	
	Запрос.Текст = "
	|ВЫБРАТЬ // Запрос, контролирующий остатки на складах
	|	Док.Номенклатура                         КАК Номенклатура,
	|	Док.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХраненияОстатков,"
	+ ?(ЕстьСчетУчетаБУ, "
	|	&СчетУчетаБУ                                        КАК СчетУчетаБУ,"
	,"")
	+ ?(ВестиСкладскойУчетБУ, ТекстСкладаДок, "")
	+ ?(ЕстьХарактеристика, "
	|	Док." + ТекстХарактеристикаНоменклатуры + "           КАК ХарактеристикаНоменклатуры,"
	,"")
	+ ?(ЕстьСерия, "
	|	Док." + ТекстСерияНоменклатуры + "                    КАК СерияНоменклатуры,"
	,"") + "
	|   &Комиссионер                                           КАК Комиссионер,"
	+ ТекстКоличество + "
	|	МАКСИМУМ(Остатки.КоличествоОстаток)                    КАК ОстатокКоличество
	|ИЗ 
	|	Документ." + ИмяТаблицы + " КАК Док
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыОрганизаций.Остатки(,
	|		Номенклатура В (" + ТекстЗапросаСписокНоменклатуры + ")
	|	И Организация = &Организация
	|   И Комиссионер = &Комиссионер
	|	) КАК Остатки
	|ПО 
	|	Док.Номенклатура        = Остатки.Номенклатура"
	+ ?(ЕстьСчетУчетаБУ, "
	| И &СчетУчетаБУ            = Остатки.СчетУчетаБУ"
	,"")
	+ ?(ВестиСкладскойУчетБУ, ТекстСкладаОстатки, "")
	+ ?(ЕстьХарактеристика, "
	| И Док." + ТекстХарактеристикаНоменклатуры + "   = Остатки.ХарактеристикаНоменклатуры"
	,"")
	+ ?(ЕстьСерия, "
	| И Док." + ТекстСерияНоменклатуры + "           = Остатки.СерияНоменклатуры"
	,"") + "
	|
	|ГДЕ
	|	Док.Ссылка  =  &ДокументСсылка
	|	И Не Док.Номенклатура.Услуга" // остатки по услугам контролировать не надо.
	+ ?(ЕстьДокументРезерва, "
	| // Если мы списываем горячий резерв, то контроль остатков по организации не нужен,
	| //поскольку с организации этот товар уже списан
	|   И НЕ (Док.ДокументРезерва ССЫЛКА Документ.РеализацияТоваровУслуг
	|         ИЛИ Док.ДокументРезерва ССЫЛКА Документ.ПередачаТоваров)", "") + "
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	Док.Номенклатура"
	+ ?(ВестиСкладскойУчетБУ, ТекстСкладаСгруппировать, "")
	+ ?(ЕстьХарактеристика, "
	|	, Док." + ТекстХарактеристикаНоменклатуры
	,"")
	+ ?(ЕстьСерия, "
	|	, Док." + ТекстСерияНоменклатуры
	,"") + "
	|
	|ДЛЯ ИЗМЕНЕНИЯ РегистрНакопления.ТоварыОрганизаций.Остатки // Блокирующие чтение таблицы остатков регистра для разрешения коллизий многопользовательской работы
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		КоличествоНаСкладе = ?(Выборка.ОстатокКоличество = NULL, 0, Выборка.ОстатокКоличество);

		Если КоличествоНаСкладе < Выборка.ДокументКоличество Тогда

			СтрокаСообщения = НСтр("ru='Остатка по организации ';uk='Залишку по організації '") + ДокументОбъект.Организация + НСтр("ru=' товара ';uk=' товару '") +  
			УправлениеЗапасами.ПредставлениеНоменклатуры(Выборка.Номенклатура, 
			                          ?(ЕстьХарактеристика, СокрЛП(Выборка.ХарактеристикаНоменклатуры), ""),
			                          ?(ЕстьСерия, СокрЛП(Выборка.СерияНоменклатуры),"")) + 
			                          ?(НЕ ЗначениеЗаполнено(Выборка.Комиссионер), "", НСтр("ru=' у комиссионера ';uk=' у комісіонера '") + Выборка.Комиссионер) +
			НСтр("ru=' недостаточно.';uk=' недостатньо.'");

			Если НЕ УправлениеДопПравамиПользователей.РазрешеноПревышениеОстаткаТоваровОрганизации(Ложь) Тогда
				УправлениеЗапасами.ОшибкаНетОстатка(СтрокаСообщения, КоличествоНаСкладе, Выборка.ДокументКоличество,
				Выборка.ЕдиницаХраненияОстатков, Отказ, Заголовок);
			Иначе
				СтрокаСообщения = СтрокаСообщения + Символы.ПС + Символы.Таб
				                + НСтр("ru='Не хватает ';uk='Не вистачає '") + (Выборка.ДокументКоличество - КоличествоНаСкладе) + " " + СокрЛП(Выборка.ЕдиницаХраненияОстатков)
				                + НСтр("ru='; Остаток ';uk='; Залишок '") + КоличествоНаСкладе + " " + СокрЛП(Выборка.ЕдиницаХраненияОстатков)
				                + "; Требуется " + Выборка.ДокументКоличество + " " + СокрЛП(Выборка.ЕдиницаХраненияОстатков);
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаСообщения);
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // КонтрольОстатков()
